from datetime import datetime

def tampilkan_header():
    print()
    print("╔════════════════════════════════════════╗")
    print("║       RENTAL KENDARAAN MAJU JAYA        ║")
    print("║       Jl. Transport No. 88              ║")
    print("╚════════════════════════════════════════╝")
    print()

def tampilkan_menu():
    print("┌────────────────────────────────────────┐")
    print("│           MENU UTAMA                   │")
    print("├────────────────────────────────────────┤")
    print("│ 1. Lihat Daftar Kendaraan              │")
    print("│ 2. Tambah Rental                       │")
    print("│ 3. Lihat Rental Aktif                  │")
    print("│ 4. Pengembalian Kendaraan              │")
    print("│ 5. Riwayat Transaksi                   │")
    print("│ 6. Keluar                              │")
    print("└────────────────────────────────────────┘")

def tampilkan_kendaraan(data):
    print("\n┌─────┬──────────────────┬────────────┬───────┐")
    print("│ ID  │ Nama Kendaraan   │ Harga/Hari │ Stok  │")
    print("├─────┼──────────────────┼────────────┼───────┤")

    for k in data:
        print(
            f"│ {k['id']:<3} │ {k['nama']:<16} │ "
            f"Rp {k['harga']:>8,} │ {k['stok']:<5} │"
        )

    print("└─────┴──────────────────┴────────────┴───────┘\n")
    print("0. Kembali ke menu utama\n")

def tampilkan_rental(rental):
    if not rental:
        print("\n📭 Tidak ada rental aktif.\n")
        return

    print("\n┌──────────────────┬────────┬────────────┐")
    print("│ Nama Kendaraan   │ Lama   │ Total      │")
    print("├──────────────────┼────────┼────────────┤")

    for r in rental:
        print(
            f"│ {r['nama']:<16} │ {r['hari']:<6} │ "
            f"Rp {r['total']:>8,} │"
        )

    print("└──────────────────┴────────┴────────────┘\n")

def cetak_struk(no, data):
    print()
    print("╔════════════════════════════════════════╗")
    print("║            STRUK RENTAL                ║")
    print("╠════════════════════════════════════════╣")
    print(f"║ No Transaksi : {no:<21} ║")
    print(f"║ Tanggal      : {datetime.now().strftime('%d/%m/%Y %H:%M:%S'):<21} ║")
    print("╠════════════════════════════════════════╣")
    print(f"║ Kendaraan    : {data['nama']:<21} ║")
    print(f"║ Lama Sewa    : {data['hari']} hari{'':<15} ║")
    print("╠════════════════════════════════════════╣")
    print(f"║ TOTAL BAYAR  : Rp {data['total']:>12,} ║")
    print("╚════════════════════════════════════════╝\n")
